espressif/esp-idf/components/soc/esp32c5/include/soc/host_struct.h
/** Type of slc1host_int_st register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_tohost_bit0_int_st : RO; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit0_int_st:1;
        /** slc1_tohost_bit1_int_st : RO; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit1_int_st:1;
        /** slc1_tohost_bit2_int_st : RO; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit2_int_st:1;
        /** slc1_tohost_bit3_int_st : RO; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit3_int_st:1;
        /** slc1_tohost_bit4_int_st : RO; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit4_int_st:1;
        /** slc1_tohost_bit5_int_st : RO; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit5_int_st:1;
        /** slc1_tohost_bit6_int_st : RO; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit6_int_st:1;
        /** slc1_tohost_bit7_int_st : RO; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit7_int_st:1;
        /** slc1_token0_1to0_int_st : RO; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_1to0_int_st:1;
        /** slc1_token1_1to0_int_st : RO; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_1to0_int_st:1;
        /** slc1_token0_0to1_int_st : RO; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_0to1_int_st:1;
        /** slc1_token1_0to1_int_st : RO; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_0to1_int_st:1;
        /** slc1host_rx_sof_int_st : RO; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_sof_int_st:1;
        /** slc1host_rx_eof_int_st : RO; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_eof_int_st:1;
        /** slc1host_rx_start_int_st : RO; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_start_int_st:1;
        /** slc1host_tx_start_int_st : RO; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_tx_start_int_st:1;
        /** slc1_rx_udf_int_st : RO; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_udf_int_st:1;
        /** slc1_tx_ovf_int_st : RO; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tx_ovf_int_st:1;
        /** slc1_rx_pf_valid_int_st : RO; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_valid_int_st:1;
        /** slc1_ext_bit0_int_st : RO; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit0_int_st:1;
        /** slc1_ext_bit1_int_st : RO; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit1_int_st:1;
        /** slc1_ext_bit2_int_st : RO; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit2_int_st:1;
        /** slc1_ext_bit3_int_st : RO; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit3_int_st:1;
        /** slc1_wifi_rx_new_packet_int_st : RO; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_wifi_rx_new_packet_int_st:1;
        /** slc1_host_rd_retry_int_st : RO; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_host_rd_retry_int_st:1;
        /** slc1_bt_rx_new_packet_int_st : RO; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_bt_rx_new_packet_int_st:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc1host_int_st_reg_t;

/** Type of pkt_len register
 *  *******Description***********
 */
typedef union {
    struct {
        /** hostslchost_slc0_len : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len:20;
        /** hostslchost_slc0_len_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len_check:12;
    };
    uint32_t val;
} slchost_pkt_len_reg_t;

/** Type of state_w0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_state0 : RO; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state0:8;
        /** slchost_state1 : RO; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state1:8;
        /** slchost_state2 : RO; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state2:8;
        /** slchost_state3 : RO; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state3:8;
    };
    uint32_t val;
} slchost_state_w0_reg_t;

/** Type of state_w1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_state4 : RO; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state4:8;
        /** slchost_state5 : RO; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state5:8;
        /** slchost_state6 : RO; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state6:8;
        /** slchost_state7 : RO; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_state7:8;
    };
    uint32_t val;
} slchost_state_w1_reg_t;

/** Type of conf_w0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf0 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf0:8;
        /** slchost_conf1 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf1:8;
        /** slchost_conf2 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf2:8;
        /** slchost_conf3 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf3:8;
    };
    uint32_t val;
} slchost_conf_w0_reg_t;

