espressif/esp-idf/components/soc/esp32c5/include/soc/host_struct.h
/** Type of slc1host_func1_int_ena register
 *  *******Description***********
 */
typedef union {
    struct {
        /** fn1_slc1_tohost_bit0_int_ena : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit0_int_ena:1;
        /** fn1_slc1_tohost_bit1_int_ena : R/W; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit1_int_ena:1;
        /** fn1_slc1_tohost_bit2_int_ena : R/W; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit2_int_ena:1;
        /** fn1_slc1_tohost_bit3_int_ena : R/W; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit3_int_ena:1;
        /** fn1_slc1_tohost_bit4_int_ena : R/W; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit4_int_ena:1;
        /** fn1_slc1_tohost_bit5_int_ena : R/W; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit5_int_ena:1;
        /** fn1_slc1_tohost_bit6_int_ena : R/W; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit6_int_ena:1;
        /** fn1_slc1_tohost_bit7_int_ena : R/W; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tohost_bit7_int_ena:1;
        /** fn1_slc1_token0_1to0_int_ena : R/W; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_token0_1to0_int_ena:1;
        /** fn1_slc1_token1_1to0_int_ena : R/W; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_token1_1to0_int_ena:1;
        /** fn1_slc1_token0_0to1_int_ena : R/W; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_token0_0to1_int_ena:1;
        /** fn1_slc1_token1_0to1_int_ena : R/W; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_token1_0to1_int_ena:1;
        /** fn1_slc1host_rx_sof_int_ena : R/W; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1host_rx_sof_int_ena:1;
        /** fn1_slc1host_rx_eof_int_ena : R/W; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1host_rx_eof_int_ena:1;
        /** fn1_slc1host_rx_start_int_ena : R/W; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1host_rx_start_int_ena:1;
        /** fn1_slc1host_tx_start_int_ena : R/W; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1host_tx_start_int_ena:1;
        /** fn1_slc1_rx_udf_int_ena : R/W; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_rx_udf_int_ena:1;
        /** fn1_slc1_tx_ovf_int_ena : R/W; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_tx_ovf_int_ena:1;
        /** fn1_slc1_rx_pf_valid_int_ena : R/W; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_rx_pf_valid_int_ena:1;
        /** fn1_slc1_ext_bit0_int_ena : R/W; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_ext_bit0_int_ena:1;
        /** fn1_slc1_ext_bit1_int_ena : R/W; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_ext_bit1_int_ena:1;
        /** fn1_slc1_ext_bit2_int_ena : R/W; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_ext_bit2_int_ena:1;
        /** fn1_slc1_ext_bit3_int_ena : R/W; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_ext_bit3_int_ena:1;
        /** fn1_slc1_wifi_rx_new_packet_int_ena : R/W; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_wifi_rx_new_packet_int_ena:1;
        /** fn1_slc1_host_rd_retry_int_ena : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_host_rd_retry_int_ena:1;
        /** fn1_slc1_bt_rx_new_packet_int_ena : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t fn1_slc1_bt_rx_new_packet_int_ena:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc1host_func1_int_ena_reg_t;

/** Type of slc0host_func2_int_ena register
 *  *******Description***********
 */
typedef union {
    struct {
        /** fn2_slc0_tohost_bit0_int_ena : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit0_int_ena:1;
        /** fn2_slc0_tohost_bit1_int_ena : R/W; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit1_int_ena:1;
        /** fn2_slc0_tohost_bit2_int_ena : R/W; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit2_int_ena:1;
        /** fn2_slc0_tohost_bit3_int_ena : R/W; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit3_int_ena:1;
        /** fn2_slc0_tohost_bit4_int_ena : R/W; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit4_int_ena:1;
        /** fn2_slc0_tohost_bit5_int_ena : R/W; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit5_int_ena:1;
        /** fn2_slc0_tohost_bit6_int_ena : R/W; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit6_int_ena:1;
        /** fn2_slc0_tohost_bit7_int_ena : R/W; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tohost_bit7_int_ena:1;
        /** fn2_slc0_token0_1to0_int_ena : R/W; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_token0_1to0_int_ena:1;
        /** fn2_slc0_token1_1to0_int_ena : R/W; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_token1_1to0_int_ena:1;
        /** fn2_slc0_token0_0to1_int_ena : R/W; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_token0_0to1_int_ena:1;
        /** fn2_slc0_token1_0to1_int_ena : R/W; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_token1_0to1_int_ena:1;
        /** fn2_slc0host_rx_sof_int_ena : R/W; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0host_rx_sof_int_ena:1;
        /** fn2_slc0host_rx_eof_int_ena : R/W; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0host_rx_eof_int_ena:1;
        /** fn2_slc0host_rx_start_int_ena : R/W; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0host_rx_start_int_ena:1;
        /** fn2_slc0host_tx_start_int_ena : R/W; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0host_tx_start_int_ena:1;
        /** fn2_slc0_rx_udf_int_ena : R/W; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_rx_udf_int_ena:1;
        /** fn2_slc0_tx_ovf_int_ena : R/W; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_tx_ovf_int_ena:1;
        /** fn2_slc0_rx_pf_valid_int_ena : R/W; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_rx_pf_valid_int_ena:1;
        /** fn2_slc0_ext_bit0_int_ena : R/W; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_ext_bit0_int_ena:1;
        /** fn2_slc0_ext_bit1_int_ena : R/W; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_ext_bit1_int_ena:1;
        /** fn2_slc0_ext_bit2_int_ena : R/W; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_ext_bit2_int_ena:1;
        /** fn2_slc0_ext_bit3_int_ena : R/W; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_ext_bit3_int_ena:1;
        /** fn2_slc0_rx_new_packet_int_ena : R/W; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_rx_new_packet_int_ena:1;
        /** fn2_slc0_host_rd_retry_int_ena : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_slc0_host_rd_retry_int_ena:1;
        /** fn2_gpio_sdio_int_ena : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t fn2_gpio_sdio_int_ena:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc0host_func2_int_ena_reg_t;

