espressif/esp-idf/components/soc/esp32c5/include/soc/host_struct.h
/** Type of inf_st register
 *  *******Description***********
 */
typedef union {
    struct {
        /** sdio20_mode : RO; bitpos: [4:0]; default: 0;
         *  *******Description***********
         */
        uint32_t sdio20_mode:5;
        /** sdio_neg_samp : RO; bitpos: [9:5]; default: 0;
         *  *******Description***********
         */
        uint32_t sdio_neg_samp:5;
        /** sdio_quick_in : RO; bitpos: [14:10]; default: 0;
         *  *******Description***********
         */
        uint32_t sdio_quick_in:5;
        /** dll_on_sw : R/W; bitpos: [15]; default: 0;
         *  dll is controlled by software
         */
        uint32_t dll_on_sw:1;
        /** dll_on : R/W; bitpos: [16]; default: 0;
         *  Software dll on
         */
        uint32_t dll_on:1;
        /** clk_mode_sw : R/W; bitpos: [17]; default: 0;
         *  dll clock mode is controlled by software
         */
        uint32_t clk_mode_sw:1;
        /** clk_mode : R/W; bitpos: [19:18]; default: 0;
         *  Software set clock mode
         */
        uint32_t clk_mode:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} slchost_inf_st_reg_t;


typedef struct {
    uint32_t reserved_000[4];
    volatile slchost_func2_0_reg_t func2_0;
    volatile slchost_func2_1_reg_t func2_1;
    uint32_t reserved_018[2];
    volatile slchost_func2_2_reg_t func2_2;
    uint32_t reserved_024[4];
    volatile slchost_gpio_status0_reg_t gpio_status0;
    volatile slchost_gpio_status1_reg_t gpio_status1;
    volatile slchost_gpio_in0_reg_t gpio_in0;
    volatile slchost_gpio_in1_reg_t gpio_in1;
    volatile slchost_slc0host_token_rdata_reg_t slc0host_token_rdata;
    volatile slchost_slc0_host_pf_reg_t slc0_host_pf;
    volatile slchost_slc1_host_pf_reg_t slc1_host_pf;
    volatile slchost_slc0host_int_raw_reg_t slc0host_int_raw;
    volatile slchost_slc1host_int_raw_reg_t slc1host_int_raw;
    volatile slchost_slc0host_int_st_reg_t slc0host_int_st;
    volatile slchost_slc1host_int_st_reg_t slc1host_int_st;
    volatile slchost_pkt_len_reg_t pkt_len;
    volatile slchost_state_w0_reg_t state_w0;
    volatile slchost_state_w1_reg_t state_w1;
    volatile slchost_conf_w0_reg_t conf_w0;
    volatile slchost_conf_w1_reg_t conf_w1;
    volatile slchost_conf_w2_reg_t conf_w2;
    volatile slchost_conf_w3_reg_t conf_w3;
    volatile slchost_conf_w4_reg_t conf_w4;
    volatile slchost_conf_w5_reg_t conf_w5;
    volatile slchost_win_cmd_reg_t win_cmd;
    volatile slchost_conf_w6_reg_t conf_w6;
    volatile slchost_conf_w7_reg_t conf_w7;
    volatile slchost_pkt_len0_reg_t pkt_len0;
    volatile slchost_pkt_len1_reg_t pkt_len1;
    volatile slchost_pkt_len2_reg_t pkt_len2;
    volatile slchost_conf_w8_reg_t conf_w8;
    volatile slchost_conf_w9_reg_t conf_w9;
    volatile slchost_conf_w10_reg_t conf_w10;
    volatile slchost_conf_w11_reg_t conf_w11;
    volatile slchost_conf_w12_reg_t conf_w12;
    volatile slchost_conf_w13_reg_t conf_w13;
    volatile slchost_conf_w14_reg_t conf_w14;
    volatile slchost_conf_w15_reg_t conf_w15;
    volatile slchost_check_sum0_reg_t check_sum0;
    volatile slchost_check_sum1_reg_t check_sum1;
    volatile slchost_slc1host_token_rdata_reg_t slc1host_token_rdata;
    volatile slchost_slc0host_token_wdata_reg_t slc0host_token_wdata;
    volatile slchost_slc1host_token_wdata_reg_t slc1host_token_wdata;
    volatile slchost_token_con_reg_t token_con;
    volatile slchost_slc0host_int_clr_reg_t slc0host_int_clr;
    volatile slchost_slc1host_int_clr_reg_t slc1host_int_clr;
    volatile slchost_slc0host_func1_int_ena_reg_t slc0host_func1_int_ena;
    volatile slchost_slc1host_func1_int_ena_reg_t slc1host_func1_int_ena;
    volatile slchost_slc0host_func2_int_ena_reg_t slc0host_func2_int_ena;
    volatile slchost_slc1host_func2_int_ena_reg_t slc1host_func2_int_ena;
    volatile slchost_slc0host_int_ena_reg_t slc0host_int_ena;
    volatile slchost_slc1host_int_ena_reg_t slc1host_int_ena;
    volatile slchost_slc0host_rx_infor_reg_t slc0host_rx_infor;
    volatile slchost_slc1host_rx_infor_reg_t slc1host_rx_infor;
    volatile slchost_slc0host_len_wd_reg_t slc0host_len_wd;
    volatile slchost_slc_apbwin_wdata_reg_t slc_apbwin_wdata;
    volatile slchost_slc_apbwin_conf_reg_t slc_apbwin_conf;
    volatile slchost_slc_apbwin_rdata_reg_t slc_apbwin_rdata;
    volatile slchost_rdclr0_reg_t rdclr0;
    volatile slchost_rdclr1_reg_t rdclr1;
    volatile slchost_slc0host_int_ena1_reg_t slc0host_int_ena1;
    volatile slchost_slc1host_int_ena1_reg_t slc1host_int_ena1;
    uint32_t reserved_11c[23];
    volatile slchost_slchostdate_reg_t slchostdate;
    volatile slchost_slchostid_reg_t slchostid;
    uint32_t reserved_180[28];
    volatile slchost_conf_reg_t conf;
    volatile slchost_inf_st_reg_t inf_st;
} slchost_dev_t;

extern slchost_dev_t HOST;

#ifndef __cplusplus
_Static_assert(sizeof(slchost_dev_t) == 0x1f8, "Invalid size of slchost_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
